Revit 2024 API
View3D.ShowGridsOnLevels Method
 This method displays the grid lines in this 3D view on the given Levels.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public void ShowGridsOnLevels(
	ISet<ElementId> levelsIds
)
Visual Basic
Public Sub ShowGridsOnLevels ( _
	levelsIds As ISet(Of ElementId) _
)
Visual C++
public:
void ShowGridsOnLevels(
	ISet<ElementId^>^ levelsIds
)
Parameters
levelsIds
Type: System.Collections.Generic.ISet<ElementId>
 Levels ids where grids lines will be displayed.
Remarks
 Previously selected Levels for showing grids will be replaced with the new ids.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
View3D Class
Autodesk.Revit.DB Namespace